<?php
// 이메일 리스트
$email_list = Array('직접입력',
    'naver.com','hanmail.net','nate.com',
    'gmail.com','yahoo.co.kr','hotmail.com',
    'empal.com','paran.com','hanafos.com',
    'dreamwiz.com','freechal.com','korea.com',
    'kornet.net','netian.com','chollian.net');

$status = array('A'=>'처리중','Y'=>'처리완료','N'=>'반려');
$status2 = array('A'=>'처리중','Y'=>'승인','N'=>'반려','C'=>'취소');
$status3 = array('A'=>'처리미완료','Y'=>'처리완료','N'=>'반려');
$vacation = array('1'=>'연차','2'=>'오전반차','3'=>'오후반차','4'=>'하계휴가','5'=>'경조휴가','6'=>'대체휴가','7'=>'보건휴가','8'=>'포상휴가','9'=>'출산휴가','10'=>'기타');
$gender = array('M'=>'남성','F'=>'여성');
$degree_level = array('1'=>'고등학교','2'=>'전문대학','3'=>'대학교','4'=>'대학원');
$degree_level2 = array('1'=>'없음','2'=>'고등학교','3'=>'전문학사','4'=>'학사','5'=>'석사','6'=>'박사');
$degree_level3 = array('1'=>'고졸','2'=>'전문학사','3'=>'학사','4'=>'석사','5'=>'박사');
$foreigner_array = array('T'=>'내국인','F'=>'외국인');
$allowance = array('T'=>'O','F'=>'X');
$together = array('T'=>'동거','F'=>'비동거');
$householder = array('T'=>'O','F'=>'X');
$appointment = array('1'=>'발령','2'=>'겸직');
$appointment_type = array('1'=>'입사','2'=>'보임','3'=>'승진','4'=>'강등','5'=>'겸직','6'=>'전직','7'=>'전근','8'=>'전출','9'=>'전적','10'=>'전보');
$punishment = array('1'=>'상','2'=>'벌');
$graduate_type_array = array('1'=>'졸업','2'=>'재학','3'=>'수료','4'=>'중퇴','5'=>'졸업예정');
$member_state = array('S'=> '신청전', 'A' => '신청' , 'N' => '거부' ,'Y'=> '재직' , 'D'=>'퇴직');
$member_state_v2 = array('S'=> '입사예정'  ,'Y'=> '재직' , 'D'=>'퇴직' , 'H'=>'휴직');
$company_type_array = array('1'=>'사외','2'=>'사내');
$family_type_array = array('1'=>'부','2'=>'모','3'=>'형제','4'=>'자매','5'=>'조모','6'=>'조부','7'=>'외조모','8'=>'외조부','9'=>'배우자','10'=>'자녀');
$result_array = array('1'=>'진행중','2'=>'완료','3'=>'보류','4'=>'취소');

$disorder_type_1 = array('1'=>'무','2'=>'유');
$disorder_type_2 = array('1'=>'없음','2'=>'지체장애','3'=>'뇌병변장애','4'=>'시각장애'
,'5'=>'청각장애','6'=>'언어장애','7'=>'지적장애','8'=>'정신장애','9'=>'자폐성장애'
,'10'=>'신창장애','11'=>'심장장애','12'=>'호흡기장애','13'=>'간장애','14'=>'안면장애'
,'15'=>'장루/요루장애','16'=>'뇌전증장애','17'=>'상이 국가유공자','18'=>'중증환자(지병)','19'=>'기타');
$disorder_type_3 = array('1'=>'없음','2'=>'1등급','3'=>'2등급','4'=>'3등급','5'=>'4등급','6'=>'5등급','7'=>'6등급','8'=>'7등급');
$nation_type_1 = array('1'=>'무','2'=>'유');
$nation_type_2 = array('1'=>'없음','2'=>'독립유공자','3'=>'순국순열','4'=>'전몰군경'
,'5'=>'전산군경','6'=>'순직군경','7'=>'공상군경','8'=>'무공수훈자','9'=>'보훈수훈자'
,'10'=>'6.25참전 재일학도의용군인','11'=>'4.19혁명 사망자','12'=>'4.19혁명 부상자','13'=>'4.19혁명 공로자','14'=>'순직공무원'
,'15'=>'공상공무원','16'=>'국가사회발전 특별 공로 순직자 및 상이자','17'=>'광주민주유공자','18'=>'광주민주화운동 사망자 또는 해방불명자','19'=>'기타 광주민주화운동희생자'
,'20'=>'참전유공자(분류)','21'=>'참전유공자','22'=>'고엽제후유(의)증','23'=>'월남전참전'
,'24'=>'국내정방근무','25'=>'고엽체후유증 2세환자','26'=>'유족','27'=>'제대군인'
,'28'=>'특별공로상이자 및 특별공로자','29'=>'특별공로순직자','30'=>'기타');
// 병력
$arm_type = array('1'=>'비대상','2'=>'필','3'=>'미필','4'=>'면제','5'=>'특례중','6'=>'특례필','7'=>'의가사제대','8'=>'의병제대','9'=>'전역예정');
$arm_group = array('0'=>'없음','1'=>'공군','2'=>'공익','3'=>'육군','4'=>'의경','5'=>'의무소방','6'=>'전경','7'=>'해군','8'=>'해병','9'=>'기타');
$arm_class = array('0'=>'없음','1'=>'이병','2'=>'일병','3'=>'상병','4'=>'병장','5'=>'하사','6'=>'중사','7'=>'상사','8'=>'원사','9'=>'준위','10'=>'소위','11'=>'중위','12'=>'대위','13'=>'소령','14'=>'중령','15'=>'대령이상');
$weekly_array = array('1'=>'해당없음','2'=>'주간','3'=>'야간'); //주야간구분
$evaluation_class_array = array('1'=>'S','2'=>'A','3'=>'B','4'=>'C','5'=>'D'); //주야간구분
?>